#!/bin/bash
### ================================================================================================
###     프로그램 명              : git_clone.bash, Version 0.00.001
###     프로그램 설명         	: Git project clone
###     작성자                     : 산사랑 (consult@jopenbusiness.com, www.jopenbusiness.com)
###     작성일                     : 2015.8.3 ~ 2015.8.3
### --- [History 관리] -------------------------------------------------------------------------------
###     2015.08.03, 산사랑 : 초안 작성
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2015 산사랑, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###		Main process
### ------------------------------------------------------------------------------------------------

### ------------------------------------------------------------------------------------------------
###     사용자 입력 확인
### ------------------------------------------------------------------------------------------------
if [ "$#" = "1" ]; then
    PROJECT=$1
else
    echo "Using : git_clone.bash PROJECT"
    echo "    PROJECT             : Git Project 이름"
    echo " "
    exit 1
fi

### ------------------------------------------------------------------------------------------------
###     중복 실행을 방지 합니다.
### ------------------------------------------------------------------------------------------------
TMPSTR=`ls -alF ~/repo_git | grep ${PROJECT} | wc -l`
if [ "${TMPSTR}" = "1" ]; then
    echo "이미 ${PROJECT} Git Project가 있습니다."
    echo " "
    exit 2
fi

### ------------------------------------------------------------------------------------------------
###     Git Project clone
###         .ssh/id_rsa 파일에 인증 정보가 있어야 합니다.
###             사용자에 따라 pnuskgh 또는 consult를 선택하여야 합니다.
###         git push origin HEAD:refs/for/master
### ------------------------------------------------------------------------------------------------
USERNAME=`git config user.name`
if [ "${USERNAME}" = "" ]; then
    echo "git user가 설정되어 있지 않습니다."
    echo " "
    exit 3
fi

cd ~/repo_git
git clone ssh://${USERNAME}@gerrit.osscloud.biz:29418/${PROJECT}

cd ${PROJECT}
scp -p -P 29418 ${USERNAME}@gerrit.osscloud.biz:hooks/commit-msg .git/hooks/

# gitdir=$(git rev-parse --git-dir)
# scp -p -P 29418 ${USERNAME}@gerrit.osscloud.biz:hooks/commit-msg ${gitdir}/hooks/

### ================================================================================================

