#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : healCheck.bash, Version 0.00.001
###     프로그램 설명   : Service 상태 확인
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2017.04.07 ~ 2017.04.07
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2017 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     funcUsing()
###         사용법 표시
### ------------------------------------------------------------------------------------------------
funcUsing() {
    /bin/echo "Using : healCheck.bash CHECK_URL RESPONSE"
    /bin/echo "        Service 상태를 확인 한다"
    /bin/echo "        CHECK_URL      : 상태 check URL"
    /bin/echo "        RESPONSE       : 예상되는 반환값"
    /bin/echo " "
    exit 1
}

### ----------------------------------------------------------------------------
###     healCheck : Service 상태 확인
### ----------------------------------------------------------------------------
healCheck() {
    local CHECK_URL=$1
    local RESPONSE=$2

    RESULT=`curl ${CHECK_URL} 2> /dev/null`
    if [[ "zz${RESULT}zz" == "zz${RESPONSE}zz" ]]; then
        return 0
    fi
    return 1
}

###---  Command Line에서 입력된 인수를 검사한다.
REPEAT=3
SLEEP_TIME=5
if [[ $# != 2 ]]; then
    funcUsing
fi

CHECK_URL=$1
RESPONSE=$2

### ----------------------------------------------------------------------------
###     Main process
###        Return code : 0. 정상, 1. 오류
### ----------------------------------------------------------------------------

for (( idx = 0; idx < ${REPEAT}; idx++)); do
    healCheck ${CHECK_URL} ${RESPONSE}
    if [[ $? == 0 ]]; then
        exit 0
        # break;
    fi
    sleep ${SLEEP_TIME}
done

exit 1
### ================================================================================================

