#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : repeat.bash, Version 0.00.004
###     프로그램 설명   : 명령을 반복 실행
###     작성자          : 산사랑 (consult@jopenbusiness.com, www.jopenbusiness.com)
###     작성일          : 2015.12.31 ~ 2013.12.31
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2016 산사랑, All rights reserved.
### ================================================================================================

if [[ "${SERVER_FOLDER}" == "" ]]; then
    echo "SERVER_FOLDER 환경 변수를 설정 하세요."
    echo " "
    exit 1
fi

. ${SERVER_FOLDER}/bin/config.bash > /dev/null 2>&1
. ${SERVER_FOLDER}/bin/utilCommon.bash > /dev/null 2>&1

### ------------------------------------------------------------------------------------------------
###     funcUsing, 2016.1.29 ~ 2016.1.29, Version 0.00.001
###     사용법을 표시 합니다.
### ------------------------------------------------------------------------------------------------
funcUsing() {
    info "Using : repeat.bash DURATION COMMAND"
    info "        DURATION             : 반복 실행 간격"
    info "        COMMAND              : 반복 실행할 명령"
    info " "
    exit 2
}

### ------------------------------------------------------------------------------------------------
###     Main, 2016.1.29 ~ 2016.1.29, Version 0.00.001
### ------------------------------------------------------------------------------------------------
###---  Command Line에서 입력된 인수를 검사한다.
if [[ 1 < $# ]]; then
    DURATION=$1
    shift
    COMMAND=$*
else
    funcUsing
fi

while true
do
    clear
    date +%Y%m%d_%H%M%S
    echo ${COMMAND}
    ${COMMAND}
    sleep ${DURATION}
done

### ================================================================================================

