#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : service_keystone.bash, Version 0.00.001
###     프로그램 설명   : Keystone Service 관리
###     작성자          : 산사랑 (consult@jopenbusiness.com, www.jopenbusiness.com)
###     작성일          : 2016.3.17 ~ 2016.3.17
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2016 산사랑, All rights reserved.
### ================================================================================================

if [[ "${SERVER_FOLDER}" == "" ]]; then
    echo "SERVER_FOLDER 환경 변수를 설정 하세요."
    echo " "
    exit 1
fi

. ${SERVER_FOLDER}/bin/config.bash > /dev/null 2>&1
. ${SERVER_FOLDER}/bin/utilCommon.bash > /dev/null 2>&1

### ------------------------------------------------------------------------------------------------
###     funcUsing, 2016.3.17 ~ 2016.3.17, Version 0.00.001
###     사용법을 표시 합니다.
### ------------------------------------------------------------------------------------------------
funcUsing() {
    info "Using : service_keystone.bash COMMAND"
    info "        COMMAND              : 실행할 명령"

    info "    COMMAND"
    info "        start                : 서비스 시작"
    info "        restart              : 서비스 재시작"
    info "        stop                 : 서비스 종료"
    info "        status               : 서비스 상태 확인"

    info " "
    exit 2
}

### ------------------------------------------------------------------------------------------------
###     funcNoService, 2016.3.17 ~ 2016.3.17, Version 0.00.001
### ------------------------------------------------------------------------------------------------
funcNoService() {
   ssh.bash controller 'initctl stop keystone' > /dev/null 2>&1
   ssh.bash controller '/etc/init.d/keystone stop' > /dev/null 2>&1
}

### ------------------------------------------------------------------------------------------------
###     funcStart, 2016.3.17 ~ 2016.3.17, Version 0.00.001
### ------------------------------------------------------------------------------------------------
funcStart() {
   ssh.bash controller '/etc/init.d/apache2 start'
   funcNoService
}

### ------------------------------------------------------------------------------------------------
###     funcRestart, 2016.3.17 ~ 2016.3.17, Version 0.00.001
### ------------------------------------------------------------------------------------------------
funcRestart() {
   ssh.bash controller '/etc/init.d/apache2 restart'
   funcNoService
}

### ------------------------------------------------------------------------------------------------
###     funcStop, 2016.3.17 ~ 2016.3.17, Version 0.00.001
### ------------------------------------------------------------------------------------------------
funcStop() {
   ssh.bash controller '/etc/init.d/apache2 stop'
   funcNoService
}

### ------------------------------------------------------------------------------------------------
###     funcStatus, 2016.3.17 ~ 2016.3.17, Version 0.00.001
### ------------------------------------------------------------------------------------------------
funcStatus() {
   ssh.bash controller '/etc/init.d/apache2 status'
   funcNoService
}

### ------------------------------------------------------------------------------------------------
###     Main, 2016.3.17 ~ 2016.3.17, Version 0.00.001
### ------------------------------------------------------------------------------------------------
###---  Command Line에서 입력된 인수를 검사한다.
if [[ 0 < $# ]]; then
    COMMAND=$1
    shift
    OPTIONS=$*
else
    funcUsing
fi

case ${COMMAND} in
    start)
        funcStart ${OPTIONS}
        ;;
    restart)
        funcRestart ${OPTIONS}
        ;;
    stop)
        funcStop ${OPTIONS}
        ;;
    status)
        funcStatus ${OPTIONS}
        ;;
    *)
        funcUsing
        ;;
esac
exit 0

### ================================================================================================

