#!/bin/bash
### ================================================================================================
###     프로그램 명  			: showinfo_os, Version 0.00.005
###     프로그램 설명   		: OS 정보를 표시 합니다.
###     작성자          		: 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          		: 2002.07.15 ~ 2017.12.15
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          		:
###     수정일          		:
###     수정 내용       		:
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2018 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     Include
### ------------------------------------------------------------------------------------------------
if [[ "z${HOME_SERVICE}z" == "zz" ]]; then
    export HOME_SERVICE="/service"
fi

source ${HOME_SERVICE}/bin/config.bash > /dev/null 2>&1

### ------------------------------------------------------------------------------------------------
###     Main process
### ------------------------------------------------------------------------------------------------
INFO_CPU=`/bin/cat /proc/cpuinfo | /bin/grep processor | /usr/bin/wc -l`
INFO_MEMORY=`/usr/bin/free -m | /bin/awk '/Mem/{print $2}'`
INFO_DISK=`lsblk | grep disk | /bin/awk '{print $4}'`

echo "${OS_NAME} ${OS_VERSION} (${INFO_CPU} cpu / ${INFO_MEMORY} KB memory / ${INFO_DISK} disk)"
df -h | grep /dev | grep -v tmp | /bin/awk '{print "    ", $0}'
echo " "

echo 'Shutdown 명령             : shutdown -h now'
echo 'Restart 명령              : shutdown -r now'

### ================================================================================================
