#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : show.bash, Version 0.00.008
###     프로그램 설명   : 사용자에게 여러가지 정보를 제공 합니다.
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 1995.02.20 ~ 2019.09.02
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2018 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     초기 환경을 설정 합니다.
### ------------------------------------------------------------------------------------------------
if [[ "z${HOME_SERVICE}z" == "zz" ]]; then
    export HOME_SERVICE="/service"
fi

source ${HOME_SERVICE}/bin/config.bash > /dev/null 2>&1

export HOME_work="/work"
FILE_README="${HOME}/README.md"
FILE_SOFTWARE="${HOME_work}/conf/software.md"

### ------------------------------------------------------------------------------------------------
###     사용법을 표시 합니다.
### ------------------------------------------------------------------------------------------------
funcUsing() {
    echo "Using : show.bash [COMMAND]"
    echo "        COMMAND"
    echo "            help             : 도움말 표시"
    echo "            info             : 기본 정보 표시"
    echo "            server           : Server 정보 표시"
    echo "            software         : Software 정보 표시"
    echo " "
    exit 2
}

### ------------------------------------------------------------------------------------------------
###     Command Line Argument를 확인 합니다.
### ------------------------------------------------------------------------------------------------
if [[ $# == 1 ]]; then
    COMMAND=$1
else
    COMMAND='default'
    # funcUsing
fi

### ------------------------------------------------------------------------------------------------
###     Server 정보를 표시 한다.
### ------------------------------------------------------------------------------------------------
funcServer() {
    echo 'Server information'
    echo '    CentOS Ver.    :' `cat /etc/*-release | grep release | uniq`, `uname -p`
    echo '    CPU 개수       :' `cat /proc/cpuinfo | grep processor | wc -l` CPU
    echo '    Memory (MB)    :' `free -m | grep Mem | awk '{print $2}'` MB
}

### ------------------------------------------------------------------------------------------------
###     Software 정보를 표시 한다.
### ------------------------------------------------------------------------------------------------
funcSoftware() {
    cat ${FILE_SOFTWARE}
}

### ------------------------------------------------------------------------------------------------
###     Main process
### ------------------------------------------------------------------------------------------------
case ${COMMAND} in
    help)
        funcUsing
        ;;
    info)
        clear
        cat ${FILE_README}
        ;;
    default)
        clear
        if [[ -f README.md ]]; then
            cat README.md
        else
            cat ${FILE_README}
        fi
        ;;
    server)
        clear
        funcServer
        ;;
    software)
        clear
        funcSoftware
        ;;
    *)
        funcUsing
        ;;
esac
echo " "

exit 0
### ================================================================================================

