#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명  			: showinfo.bash, Version 0.00.006
###     프로그램 설명   		: Linux server의 정보를 표시 합니다.
###     작성자          		: 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          		: 2002.07.15 ~ 2017.12.15
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          		:
###     수정일          		:
###     수정 내용       		:
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2018 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     Include
### ------------------------------------------------------------------------------------------------
if [[ "z${HOME_SERVICE}z" == "zz" ]]; then
    export HOME_SERVICE="/service"
fi

source ${HOME_SERVICE}/bin/config.bash > /dev/null 2>&1

### ------------------------------------------------------------------------------------------------
###     funcRunCmd($0), 2017.12.15 ~ 2017.12.15, Version 0.00.001
###     명령어 실행
### ------------------------------------------------------------------------------------------------
funcRunCmd() {
    local COMMAND

    COMMAND=$1
    CMD_FILE=${HOME_WORK}/bin/showinfo_${COMMAND}.bash
    if [[ -f ${CMD_FILE} ]]; then
        exec bash ${CMD_FILE}
    else
        CMD_FILE=${HOME_SERVICE}/bin/showinfo_${COMMAND}.bash
        if [[ -f ${CMD_FILE} ]]; then
            source ${CMD_FILE}
        fi
    fi
}

### ------------------------------------------------------------------------------------------------
###     Main process
### ------------------------------------------------------------------------------------------------
clear

if [[ 0 = $# ]]; then
    cat ~/README.md
    exit 0
fi
COMMAND=$1

for COMMAND in $*; do
    case "${COMMAND}" in
        help)
            ls -alF ${HOME_WORK}/bin/showinfo_*.bash ${HOME_SERVICE}/bin/showinfo_*.bash 2> /dev/null
            ;;
        *)
            funcRunCmd ${COMMAND}
            ;;
    esac
    echo " "
    echo " "
done
exit 0
### ================================================================================================

