#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : check_network.bash, Version 0.00.005
###     프로그램 설명   : VirtualBox 가상 서버의 Network를 초기화 한다.
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2017.01.06 ~ 2017.03.10
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2017 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     Network 초기화
###         로그인이 안되거나 공인망에 접속이 안될 경우에 실행 한다.
### ------------------------------------------------------------------------------------------------
ping -c 3 google.com
if [[ $? = 0 ]]; then
    exit 0
fi

cd /etc/sysconfig/network-scripts
ifdown ifcfg-enp0s3
ifup   ifcfg-enp0s3

ping -c 3 google.com
if [[ $? = 0 ]]; then
    exit 0
fi

systemctl restart network.service

ping -c 3 google.com
if [[ $? = 0 ]]; then
    echo "Network 접속 정상"
else
    echo "Error : Network 접속 오류"
fi
echo " "

### ================================================================================================

