#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : convert_image.bash, Version 0.00.001
###     프로그램 설명   : VirtualBox의 vdi 이미지를 qcow2 이미지로 변환 한다.
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2017.01.04 ~ 2017.01.04
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2017 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     VirtualBox의 vdi 이미지를 qcow2 이미지로 변환 한다.
###         IDC_DOC_manage 장비에서 작업 한다.
### ------------------------------------------------------------------------------------------------
yum -y install libguestfs-tools

mkdir -p /data/osimage/CentOS7/convert

#--- 사전에 /data/osimage/CentOS7/convert/ 폴더에 CentOS7_64.vdi 파일을 업로드 하여야 한다.
cd /data/osimage/CentOS7/convert
rm CentOS7_64.qcow2
qemu-img convert -c -f vdi -O qcow2 CentOS7_64.vdi CentOS7_64.qcow2

### ================================================================================================

