#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : config.bash, Version 0.00.002
###     프로그램 설명   : Bash Script를 실행하기 위한 환경을 설정 한다.
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2017.03.28 ~ 2017.03.30
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2017 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

BACKUP_DIR=${WORKING_DIR}/backup
TEMPLATE_DIR=${WORKING_DIR}/template

TIMESTAMP=`date +%Y%m%d_%H%M%S`

DOCUMENT_ROOT=/usr/share/nginx/html

### ================================================================================================

