#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : setup_db.bash, Version 0.00.001
###     프로그램 설명   : WordPress용 Dabase 생성과 접속 권한 설정
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2017.03.30 ~ 2017.03.30
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2017 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     실행 환경을 설정 한다.
### ------------------------------------------------------------------------------------------------
source ${HOME_SERVICE}/bin/config.bash > /dev/null 2>&1
source ${UTIL_DIR}/common.bash > /dev/null 2>&1

RELATION_DIR="$(dirname $0)"
WORKING_DIR="$(cd -P ${RELATION_DIR}/.. && pwd)"
source ${WORKING_DIR}/bin/config.bash

### ------------------------------------------------------------------------------------------------
###     WordPress 설치
### ------------------------------------------------------------------------------------------------
${HOME_SERVICE}/service_sw/MariaDB/bin/createDatabase.bash ${DB_NAME} ${DB_USER} ${DB_PASSWORD} ${PASSWD_ROOT}

${HOME_SERVICE}/service_sw/MariaDB/bin/allowDBConnection.bash ${DB_NAME} ${DB_USER} ${DB_PASSWORD} ${DB_HOST} ${PASSWD_ROOT}

### ================================================================================================

