#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : centos_init.bash, Version 0.00.008
###     프로그램 설명   : CentOS 초기화 설정을 합니다.
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 1995.02.20 ~ 2018.02.28
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2018 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     실행 환경을 설정 합니다.
### ------------------------------------------------------------------------------------------------
if [[ "z${HOME_SERVICE}z" == "zz" ]]; then
    export HOME_SERVICE="/service"
fi

source ${HOME_SERVICE}/bin/config.bash > /dev/null 2>&1

SOFTWARE="CentOS7"
if [[ -f ${HOME_SERVICE}/${SOFTWARE}/bin/config.php ]]; then
    source ${HOME_SERVICE}/${SOFTWARE}/bin/config.php
fi

### ------------------------------------------------------------------------------------------------
###     잠시 멈춤을 구현 합니다.
### ------------------------------------------------------------------------------------------------
funcPause() {
    echo -n "잠시 멈춤 ..."
    read ZZTEMP
}

### ------------------------------------------------------------------------------------------------
###     Network를 설정 합니다.
### ------------------------------------------------------------------------------------------------
echo "--- Network를 설정 합니다."
echo "vi  /etc/sysconfig/network-scripts/ifcfg-*"
echo "ifdown  ifcfg-eth0;  ifup  ifcfg-eth0"
echo "ifdown  ifcfg-eth1;  ifup  ifcfg-eth1"
echo "ip addr list"
echo "ping  -c  3  google.com"
funcPause
echo " "

### ------------------------------------------------------------------------------------------------
###     EPEL 레파지토리를 추가 한다.
### ------------------------------------------------------------------------------------------------
echo "--- EPEL 레파지토리를 추가 한다."
yum -y install epel-release
# yum repolist all
yum repolist
echo "---     방법 2 "
echo "rpm -Uvh https://dl.fedoraproject.org/pub/epel/epel-release-latest-7.noarch.rpm"
echo "rpm -Uvh ${HOME_SERVICE}/${SOFTWARE}/template/epel-release-latest-7.noarch.rpm"
echo "---     방법 3 "
echo "cp -f ${HOME_SERVICE}/${SOFTWARE}/template/epel.repo /etc/yum.repos.d"
echo "cp -f ${HOME_SERVICE}/${SOFTWARE}/template/epel-testing.repo /etc/yum.repos.d"
funcPause
echo " "

### ------------------------------------------------------------------------------------------------
###     CentOS 7을 업데이트 한다.
### ------------------------------------------------------------------------------------------------
echo "--- CentOS 7을 업데이트 한다."
yum -y update
echo " "

### ------------------------------------------------------------------------------------------------
###     불필요한 패키지와 서비스를 제거 한다.
### ------------------------------------------------------------------------------------------------
echo "--- 불필요한 패키지와 서비스를 제거 한다."
yum -y remove NetworkManager
echo " "

### ------------------------------------------------------------------------------------------------
###     centos 사용자가 없을 경우 사용자를 추가 한다.
### ------------------------------------------------------------------------------------------------
echo "--- centos 사용자가 없을 경우 사용자를 추가 한다."
echo "groupadd centos"
echo "useradd -d /home/centos -s /usr/bin/bash -m -g centos centos"
funcPause
echo " "

### ------------------------------------------------------------------------------------------------
###     Hostname을 설정 합니다.
### ------------------------------------------------------------------------------------------------
echo "--- hostname을 설정 합니다."
echo "hostnamectl set-hostname www.obcon.biz"
echo "hostnamectl status"
funcPause
echo " "

exit 0
### ================================================================================================

