#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : install.bash, Version 0.00.001
###     프로그램 설명   : SELinux 관리 도구를 설치 합니다.
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2018.01.23 ~ 2018.01.23
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2018 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     실행 환경을 설정 한다.
### ------------------------------------------------------------------------------------------------
source ${HOME_SERVICE}/bin/config.bash > /dev/null 2>&1
source ${UTIL_DIR}/common.bash > /dev/null 2>&1

RELATION_DIR="$(dirname $0)"
WORKING_DIR="$(cd -P ${RELATION_DIR}/.. && pwd)"
# WORKING_DIR="/service/service_os/SELinux"
source ${WORKING_DIR}/bin/config.bash

### ------------------------------------------------------------------------------------------------
###     SELinux 환경을 설치 한다.
### ------------------------------------------------------------------------------------------------
# yum -y install selinux-policy selinux-policy-*
yum -y install setools-console
yum -y install policycoreutils-python  
# yum -y install setroubleshoot

echo "tail -f /var/log/audit/audit.log"

### ================================================================================================
