### ================================================================================================
###     프로그램 명     : initialize.R, Version 0.00.001
###     프로그램 설명   : R Studio Server 초기 환경 설정
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2017.05.08 ~ 2017.05.08
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2017 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

#--- rJava 패키지 설치
Sys.setenv(JAVA_HOME="/usr/lib/jvm/jre")
install.packages("rJava")
library(rJava)

#--- 한글 자연어 분석 패키지인 KoNLP 설치
#---     curl, openssl, httr, git2r, devtools 패키지도 같이 설치됨
install.packages("KoNLP")
library(KoNLP)

### ================================================================================================

