#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : install_scada.bash, Version 0.00.001
###     프로그램 설명   : VirtualBox에 SCADA 환경을 구성 한다.
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2018.12.19 ~ 2018.12.19
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2018 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     실행 환경을 설정 한다.
### ------------------------------------------------------------------------------------------------
SOFTWARE="SCADA"

if [[ "z${HOME_SERVICE}z" == "zz" ]]; then
    export HOME_SERVICE="/service"
fi
WORKING_DIR="${HOME_SERVICE}/${SOFTWARE}"
source ${HOME_SERVICE}/bin/config.bash > /dev/null 2>&1

if [[ -f ${WORKING_DIR}/bin/config.php ]]; then
    source ${WORKING_DIR}/bin/config.php
else
    TIMESTAMP=`date +%Y%m%d_%H%M%S`
    BACKUP_DIR=${WORKING_DIR}/backup
    TEMPLATE_DIR=${WORKING_DIR}/template
fi

### ------------------------------------------------------------------------------------------------
###     CentOS 7 64 bits를 설치 한다.
### ------------------------------------------------------------------------------------------------
#--- root 사용자 생성
#--- centos 사용자 생성
/service/CentOS7/bin/init.bash
/service/CentOS7/bin/init_before.bash

### ------------------------------------------------------------------------------------------------
###     MariaDB를 설치 한다.
### ------------------------------------------------------------------------------------------------
/service/MariaDB/bin/install.bash

### ------------------------------------------------------------------------------------------------
###     PHP 7.1을 설치 한다.
### ------------------------------------------------------------------------------------------------
/service/CentOS7/bin/install_php71.bash

### ------------------------------------------------------------------------------------------------
###     Nginx를 설치 한다.
### ------------------------------------------------------------------------------------------------
/service/Nginx/bin/install.bash

### ------------------------------------------------------------------------------------------------
###     SuiteCRM을 설치 한다.
### ------------------------------------------------------------------------------------------------
ppp
/service/SuiteCRM/bin/install.bash

### ------------------------------------------------------------------------------------------------
###     Node.js를 설치 한다.
### ------------------------------------------------------------------------------------------------
/service/Nodejs/bin/nodejs.bash

### ------------------------------------------------------------------------------------------------
###     OBCon_SCADA를 구성 한다.
### ------------------------------------------------------------------------------------------------
#--- /work/appl/obcon_scada/ 폴더 사용
cd   /work/install
wget  https://codeload.github.com/IoTKETI/Mobius/zip/master  -O  Mobius-master.zip
unzip Mobius-master.zip
mv   Mobius-master  /work/appl/obcon_scada

cd  /work/appl/obcon_scada
mkdir  -p  modbus/request  modbus/response  modbus/handler
mkdir  -p  custom/modbus/request  custom/modbus/response  custom/modbus/handler

mv  package-lock.json package-lock.json_org
mv  conf.json  conf.json_org


vi  package.json

npm  install

### ================================================================================================

