#!/usr/bin/env bash
### ================================================================================================
###     프로그램 명     : check_bridge.bash, Version 0.00.006
###     프로그램 설명   : Linux Bridge를 테스트 한다.
###     작성자          : 산사랑 (pnuskgh@gmail.com, www.jopenbusiness.com)
###     작성일          : 2017.07.03 ~ 2017.07.03
### ----[History 관리]------------------------------------------------------------------------------
###     수정자          :
###     수정일          :
###     수정 내용       :
### --- [Copyright] --------------------------------------------------------------------------------
###     Copyright (c) 1995~2017 pnuskgh, 오픈소스 비즈니스 컨설팅
###     All rights reserved.
### ================================================================================================

### ------------------------------------------------------------------------------------------------
###     Promisc 모드로 변경
### ------------------------------------------------------------------------------------------------
ip addr list 
ifconfig eth0 0.0.0.0 promisc up     
vi  /etc/sysctl.conf
    net.ipv4.ip_forward = 1

### ------------------------------------------------------------------------------------------------
###     Linux Bridge check
### ------------------------------------------------------------------------------------------------
BRIDGE_NAME="br0"

brctl show
ip addr list
 
#--- Linux Bridge 추가
brctl addbr ${BRIDGE_NAME}
brctl show
ip addr list
  
#--- Linux Bridge를 NIC와 연결
brctl addif ${BRIDGE_NAME} veth_host
brctl show
ip addr list

# brctl stp ${BRIDGE_NAME} off         #--- br0 Bridge에서 stp off (off : default) 

#--- IP 할당
ip addr add 10.0.128.103 dev ${BRIDGE_NAME}
ip addr list

ping -c 3 10.0.128.103
ip netns exec ${NAMESPACE_NAME} ping -c 3 10.0.128.103

# ip addr del 10.0.128.101/24 dev veth_host
# ip netns exec ${NAMESPACE_NAME} ping -c 3 10.0.128.103
 
### ------------------------------------------------------------------------------------------------
###     Linux Bridge clear
### ------------------------------------------------------------------------------------------------
brctl delif ${BRIDGE_NAME} veth_host
brctl delbr ${BRIDGE_NAME}

### ================================================================================================

